app/Http/Controllers/Admin/UserController.php

    public function index(Request $request)
    {
        $data = User::orderBy('id', 'DESC')->paginate(5);
---
select * from `users` order by `id` desc limit 5 offset 0
select count(*) as aggregate from `users`